{
  "posts": [
    {
      "id": "post-001",
      "date": "2025-07-27T09:30:00Z",
      "content": "<p>Hello World</p>"
    },
    {
      "id": "post-002",
      "date": "2025-07-27T10:00:00Z",
      "content": "<p>Hi everyone, I am Alex, a solo developer with a full-time job.</p><p>I have been on the hunt for the perfect todo app to help me manage my job and my life. Now I know that there is simply no such thing, but I am having a go at making something that will work for me and I hope it works for more people as well.</p><p>This project fulfills a few goals for me:</p><p>I get to make an actual app on the app store(s). I get my own custom todo app that should work for me the way I want it to. I get to learn about technologies that are quite far outside of my usual day job. I get to have fun in my own nerdy way.</p><p>This whole project is pretty cool for me :-)</p>"
    },
    {
      "id": "post-003",
      "date": "2025-07-27T11:00:00Z",
      "content": "<p>AI.</p><p>I am pretty torn about the use and the implications of AI on the world.</p><p>I use AI very liberally in this project, and it's another reason I wanted to do this project. I think it gave me a good way to learn about a technology that I think is going to be revolutionary.</p><p>Like with most technologies, once the cat is out of the bag, it can't be put back in. And I think if I don't get to grips with it, then I will be falling behind not just in my career but in life.</p><p>So I hope you don't mind my use of AI. And if you are interested in hearing more about how and why I use it, then just let me know... Somehow... I'm not sure how you can reach me just yet but I will make it possible lol.</p>"
    },
    {
      "id": "post-004",
      "date": "2025-07-27T14:00:00Z",
      "content": "<p>The RightNow app is kind of born out of <a href=\"https://gettingthingsdone.com/\" target=\"_blank\">GTD (David Allen)</a>, <a href=\"https://www.scrum.org/\" target=\"_blank\">SCRUM (Ken Schwaber and Jeff Sutherland)</a>, and the Time Blocking or <a href=\"https://calnewport.com/deep-work/\" target=\"_blank\">Deep Work principles of Cal Newport</a>.</p><p>I have been using Scrum in my professional life for over 10 years (gosh I am ageing) and in that time I have been playing around with many productivity systems. None of them work for me wholesale but they all have things that really work, so I combine them.</p><p>So the core idea of this app was to almost do a mini Sprint where we have a backlog of tasks and plan the tasks for the day based on the capacity that we have for the day.</p><p>The capacity is the real strength of this idea because you should be able to adapt your day based on what you actually have time for. The app should tell you when you don't have time to do everything and you can just kick a task back to the backlog to do the next day.</p><p>This should help with a feeling of accomplishment as well - you didn't fail to get everything done, there was simply not enough time to do it.</p><p>This idea of course means that the app needs to know how long a task will take to do and I have some ideas. Basically gamification of backlog grooming or refinement as it is now called.</p><p>We will get into that in a future post. :-D</p>"
    },
    {
      "id": "post-005",
      "date": "2025-07-28T16:00:00Z",
      "content": "<p>Recommended Reading</p><p>So in my last post I mentioned a few books that have really influenced how I think about productivity and how RightNow is taking shape. I thought I'd share them properly for anyone interested in diving deeper.</p><p>First up is <a href=\"https://gettingthingsdone.com/\" target=\"_blank\">Getting Things Done by David Allen</a>. This is basically the bible of personal productivity systems. Even if you don't follow GTD to the letter (and honestly, who does?), the principles about capturing everything and getting it out of your head are gold.</p><p>Then there's the work of Ken Schwaber and Jeff Sutherland on <a href=\"https://www.scrum.org/\" target=\"_blank\">Scrum</a>. I know Scrum is meant for teams but I think it has some really good ideas for personal planning. The whole sprint concept and backlog management? That's pure Scrum DNA in RightNow.</p><p><a href=\"https://calnewport.com/deep-work/\" target=\"_blank\">Deep Work by Cal Newport</a> is another big influence. This one's about protecting your time for meaningful work, not just being busy. The time blocking principles from this book are what inspired the capacity-first approach in RightNow. There's also a related book which is really a planner that you can use for time blocking. The principles of that are great and something that I'm really trying to incorporate into the app.</p><p>And I've got to mention <a href=\"https://bulletjournal.com/\" target=\"_blank\">The Bullet Journal Method by Ryder Carroll</a>. This gave me the concept of migrating tasks forward and having a bird's eye view of a period of time. While RightNow is digital, these bullet journal principles are at its core - consciously deciding what moves forward and seeing the bigger picture of your time.</p><p>Oh, and <a href=\"https://jamesclear.com/atomic-habits\" target=\"_blank\">Atomic Habits by James Clear</a> is a must-read. The whole idea of tiny changes compounding over time? That's what I'm trying to build into RightNow - making it easy to maintain good productivity habits without overwhelming yourself.</p><p><a href=\"http://atulgawande.com/book/the-checklist-manifesto/\" target=\"_blank\">The Checklist Manifesto by Atul Gawande</a> is a short one that packs a heckin' punch in the message it delivers. It's all about how simple checklists can prevent mistakes and improve outcomes in complex situations. This really influenced how I think about task management in RightNow.</p><p>And <a href=\"https://www.the1thing.com/\" target=\"_blank\">The ONE Thing by Gary Keller</a> introduces some great ideas about thieves of time and thieves of productivity, as well as the concept that a balanced life doesn't actually mean you do everything equally but that you do them in balance. Ignore everything else outside of the pages of the book though as it is a bit culty. So is GTD but not in the same way IMO.</p><p>No affiliate links here by the way - though I'm not opposed to the idea! Just genuinely recommending books that have helped me think differently about productivity.</p><p>Oh, and a confession - I now consume all my books as audiobooks. I've kind of lost interest in actually reading. I don't seem to have the patience for it anymore! I can listen to a book at 2x speed, sometimes 3x, which is way faster than I can actually read. I'm a terribly slow reader, so audiobooks have been a game changer for me.</p><p>Got any productivity book recommendations for me? I'm always on the hunt for new ideas to incorporate into RightNow. Once I have a formal way for you guys to reach out lol - I'd love to hear what's helped you!</p><p>Happy reading... or listening!</p>"
    },
    {
      "id": "post-006",
      "date": "2025-07-28T20:00:00Z",
      "content": "<p>Getting pretty close to an Android release now!</p><p>I've got some family and friends who have it installed and I'm getting some great feedback already. And honestly, no feedback is bad feedback at this stage - every comment, every confused look, every \"what does this mean?\" is incredibly valuable.</p><p>One thing that's become really clear is that I need to ditch some of the software industry jargon. I've changed the language around backlogs and backlog grooming to something that's not a technical term. I'm sure that nerds like me who've tried many todo apps already will pick things up quickly, but the friends I've asked to test are not techy people and their feedback has been some of the most valuable so far.</p><p>It's funny how when you're deep in the software world, you forget that terms like \"backlog\" and \"grooming\" sound completely alien to normal people. Still a bit of work to do before the public release, but we're getting there. Can't wait to get this into more hands and see what other assumptions I've made that need fixing!</p><p>If you're interested in trying out the Android version when it's ready, keep an eye on this space. I'll announce it here first. :-)</p>"
    },
    {
      "id": "post-007",
      "date": "2025-07-29T10:00:00Z",
      "content": "<p>So I was having a chat with Claude, the AI, asking about how people get enough testers to get apps into the Play Store, and it mentioned subreddits I can post in. One of the subreddits it suggested was for ADHD, and that RightNow might be a good tool for helping those with ADHD to focus.</p><p>That's got me thinking... I've not designed the app specifically with ADHD in mind, but maybe some of the features already align with what could help? The whole capacity-based planning, breaking things down into manageable chunks, and not overwhelming yourself with too many tasks - these might actually be really helpful for people with ADHD.</p><p>But I don't want to make assumptions. If you have ADHD and think this app could help (or if you can see ways it could be better), I'd love to hear from you! What features would make a productivity app more ADHD-friendly? What are the pain points with existing todo apps that don't work for you?</p><p>I'm genuinely curious about this now. Maybe there's an opportunity to make RightNow more accessible and helpful for a wider range of people. Let me know if this sounds right, and I can look into more ADHD-friendly features!</p>"
    },
    {
      "id": "post-008",
      "date": "2025-07-31T14:00:00Z",
      "content": "<p>Money Things</p><p>Let's talk about how I'm planning to monetise RightNow. This is something I've been thinking about a lot, and I want to be completely transparent about it.</p><p>Firstly, I absolutely hate arbitrary paywalls in apps. \"You've created 5 tasks this month! Upgrade to Pro for unlimited tasks!\" That's not what I want RightNow to be. My goal is to create an app that's so genuinely useful that you actually want to support it, not one that holds basic functionality hostage.</p><p>Here's my thinking: there are two types of costs in this project. First, there are development costs - Android developer license, iOS developer license, AI subscriptions for development, GitHub payments for automatic builds. These would be nice to cover with subscriptions and will influence pricing. But more importantly, there are operational costs - specifically hosting. That's the key bit. The free tier will do everything locally on your device. Full functionality, no limits, no annoying popups telling you to upgrade. The paid feature will be cloud sync - if you want to sync your todo lists across devices, that's when you'll need to pay, because that's when I'm actually incurring operational costs with Firebase hosting.</p><p>I think this is fair. If you're happy using RightNow on just one device, you get the full experience for free. If you want the convenience of having your tasks everywhere, then you're using the infrastructure I'm paying for, so it makes sense to contribute.</p><p>I've also set up a Ko-fi page at <a href=\"https://ko-fi.com/aeropher\" target=\"_blank\">ko-fi.com/aeropher</a> for one-off payments. I've given people money this way when I've found their work helpful, so I figured... why not do the same for me? If RightNow helps you and you want to buy me a coffee (or three), that'd be brilliant. No pressure though!</p><p>This is all still evolving. As the app grows and I learn more about what features people actually want, I might adjust things. But the core principle will stay the same: the free version should be genuinely useful, not a limited demo designed to frustrate you into paying.</p><p>What do you think about this approach? Does it seem fair? I'd love to hear your thoughts on app monetisation - what works for you, what doesn't, and what makes you actually want to support an app financially.</p><p>At the end of the day, I'm building RightNow because I want it to exist and I want to use it myself. If I can make it sustainable along the way, that's a bonus that lets me keep improving it for everyone.</p>"
    },
    {
      "id": "post-009",
      "date": "2025-07-31T16:00:00Z",
      "content": "<p>Discord is Live!</p><p>Right, so I've been asking people to get in touch with feedback and ideas, but I haven't actually given you a proper way to do that. Bit silly of me! So I've just set up a Discord server for RightNow.</p><p>You can join here: <a href=\"https://discord.gg/YzYagEZcnt\" target=\"_blank\">discord.gg/YzYagEZcnt</a></p><p>This is where you can:</p><ul><li>Chat about productivity and task management</li><li>Share feedback on RightNow</li><li>Suggest features</li><li>Report bugs in a more casual way than GitHub issues</li><li>Connect with other RightNow users</li></ul><p>Now, I need to be completely honest - I have a full-time job, so I won't be online 24/7. I'll check in when I can, usually evenings and weekends UK time. But the beauty of Discord is that the community can help each other too!</p><p>I'm hoping this becomes a nice little community of people interested in productivity without the overwhelm. Come say hi if you fancy it. Or don't - no pressure!</p><p>Quick note though - if you have a bug report or feature request that you really want me to see and action, GitHub issues are still your best bet. Discord messages can easily get lost in the flow of conversation, but GitHub issues stay there until I deal with them. So Discord for chatting, GitHub for things you actually want done!</p><p>See you there (maybe)!</p>"
    },
    {
      "id": "post-010",
      "date": "2025-08-04T12:00:00Z",
      "content": "<p>Instagram Soft Launch</p><p>Today I posted on my personal and public Instagram pages that I've been working on RightNow. I included a picture of the logo. It was quite a nerve racking thing actually. My public handle is @AeropherXD if you want to have a look.</p><p>The app is still very much in alpha. There's a lot I want to improve and polish before I'd consider it properly ready. But sometimes you've got to put yourself out there.</p><p>I didn't mention in the post that there's a link in my bio lol. So I don't think anyone's actually gone looking for it. Which is probably for the best at this stage. Let's call it a soft launch to less than 100 people who probably scrolled past without much thought.</p><p>I think I'll start promoting it more properly in the coming month. Once I've ironed out a few more bugs and got the Android version fully public.</p><p>I'd also love to do a little YouTube video about how I use the app myself and how I envision others using it. There's something about seeing an app in action that screenshots can't quite capture.</p><p>It's interesting how something as simple as an Instagram post can feel like quite a big step. But it's out there now. The logo is in the wild. People know I'm working on something.</p><p>If you happened to see the post and made it here... welcome. And thanks for being one of the very first to check out what I'm building.</p>"
    }
  ]
}